In [1]:
import pandas as pd

In [6]:
from pandas import Series , DataFrame

# Series

In [7]:
obj = pd.Series([4, 7, -5, 3])

In [8]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [14]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [16]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [17]:
obj2['a']

-5

In [18]:
obj2['d'] = 6

In [19]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [21]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [22]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [23]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [24]:
import numpy as np

In [25]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [26]:
'b' in obj2

True

In [27]:
'e' in obj2

False

In [78]:
 sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000 , "Pakistan":1000 }

In [79]:
obj3 = pd.Series(sdata)

In [80]:
obj3

Ohio        35000
Texas       71000
Oregon      16000
Utah         5000
Pakistan     1000
dtype: int64

In [81]:
states = ['California', 'Ohio', 'Oregon', 'Texas'  , "Utah"]

In [82]:
obj4 = pd.Series(sdata, index=states)

In [83]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
dtype: float64

In [84]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
Utah          False
dtype: bool

In [85]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
Utah           True
dtype: bool

In [86]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
Utah          False
dtype: bool

In [87]:
obj3

Ohio        35000
Texas       71000
Oregon      16000
Utah         5000
Pakistan     1000
dtype: int64

In [88]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
dtype: float64

In [89]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Pakistan           NaN
Texas         142000.0
Utah           10000.0
dtype: float64

In [90]:
obj4.name = 'population'

In [95]:
obj4.index.name = 'state'

In [96]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
Name: population, dtype: float64

In [97]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [98]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [99]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame

In [151]:
data = pd.DataFrame({'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]})

In [133]:
data

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [134]:
data.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [135]:
data.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [136]:
data.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [137]:
data.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [138]:
 pd.DataFrame(data, columns=['year', 'state'])

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada
4  2002  Nevada
5  2003  Nevada

In [139]:
 pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [140]:
 pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [141]:
 pd.DataFrame(data, columns=['year', 'state', 'pop' , "percent"])

   year   state  pop  percent
0  2000    Ohio  1.5      NaN
1  2001    Ohio  1.7      NaN
2  2002    Ohio  3.6      NaN
3  2001  Nevada  2.4      NaN
4  2002  Nevada  2.9      NaN
5  2003  Nevada  3.2      NaN

In [172]:
frame = pd.DataFrame({'state': ['Lahore', 'Islamabad', 'Dubai', 'Paris', 'Karachi', 'California'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]})

In [173]:
frame

        state  year  pop
0      Lahore  2000  1.5
1   Islamabad  2001  1.7
2       Dubai  2002  3.6
3       Paris  2001  2.4
4     Karachi  2002  2.9
5  California  2003  3.2

In [174]:
pd.DataFrame(frame, columns=['year', 'state', 'pop' , "percent"])

   year       state  pop  percent
0  2000      Lahore  1.5      NaN
1  2001   Islamabad  1.7      NaN
2  2002       Dubai  3.6      NaN
3  2001       Paris  2.4      NaN
4  2002     Karachi  2.9      NaN
5  2003  California  3.2      NaN

In [175]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [176]:
frame['state']

0        Lahore
1     Islamabad
2         Dubai
3         Paris
4       Karachi
5    California
Name: state, dtype: object

In [177]:
frame.state

0        Lahore
1     Islamabad
2         Dubai
3         Paris
4       Karachi
5    California
Name: state, dtype: object

In [184]:
frame["pop"]

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [186]:
 frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [190]:
frame.loc[0]

state    Lahore
year       2000
pop         1.5
Name: 0, dtype: object

In [191]:
frame.loc[4]

state    Karachi
year        2002
pop          2.9
Name: 4, dtype: object

In [192]:
frame['debt'] = 16.5

In [193]:
frame

        state  year  pop  debt
0      Lahore  2000  1.5  16.5
1   Islamabad  2001  1.7  16.5
2       Dubai  2002  3.6  16.5
3       Paris  2001  2.4  16.5
4     Karachi  2002  2.9  16.5
5  California  2003  3.2  16.5

In [195]:
frame['debt'] = np.arange(6.)

In [196]:
frame

        state  year  pop  debt
0      Lahore  2000  1.5   0.0
1   Islamabad  2001  1.7   1.0
2       Dubai  2002  3.6   2.0
3       Paris  2001  2.4   3.0
4     Karachi  2002  2.9   4.0
5  California  2003  3.2   5.0

In [198]:
 val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [199]:
frame['debt'] = val

In [200]:
frame

        state  year  pop  debt
0      Lahore  2000  1.5   NaN
1   Islamabad  2001  1.7   NaN
2       Dubai  2002  3.6  -1.2
3       Paris  2001  2.4   NaN
4     Karachi  2002  2.9  -1.5
5  California  2003  3.2  -1.7

In [205]:
frame['eastern'] = frame.state == 'Karachi'

In [206]:
frame

        state  year  pop  debt  eastern
0      Lahore  2000  1.5   NaN    False
1   Islamabad  2001  1.7   NaN    False
2       Dubai  2002  3.6  -1.2    False
3       Paris  2001  2.4   NaN    False
4     Karachi  2002  2.9  -1.5     True
5  California  2003  3.2  -1.7    False

In [207]:
del frame['eastern']

In [208]:
frame

        state  year  pop  debt
0      Lahore  2000  1.5   NaN
1   Islamabad  2001  1.7   NaN
2       Dubai  2002  3.6  -1.2
3       Paris  2001  2.4   NaN
4     Karachi  2002  2.9  -1.5
5  California  2003  3.2  -1.7